app/controllers/events_controller.rb

  def index
    today = params[:format]
    if today == '1'
      t = Time.now.to_s
      t = Chronic.parse(t).to_s
      t = t.split
      t = t[0]
      event = Event.where(date: t)
      @event = event.where(approved: 't')
    elsif today == '2'
      t = Chronic.parse('tommorow').to_s
      t = t.split
      t = t[0]
      event = Event.where(date: t)
      @event = event.where(approved: 't')
    else
      t = Chronic.parse('today')

      @event = Event.current_events(Event.order_dates)
---
SELECT "events".* FROM "events"  WHERE "events"."date" = '2014-11-26' AND "events"."approved" = 't'
SELECT  "events".* FROM "events"   ORDER BY "events"."id" DESC LIMIT 1

  def create
    t = Chronic.parse(params[:event][:start]).to_s
    t = t.split
    t = t[0]
    # Create a new event
    @event = Event.new(
      :event_name => params[:event][:event_name],
      :location => params[:event][:location],
      :borough => params[:event][:borough],
      :ticket_price => params[:event][:ticket_price],
      :ticket_add_1 => params[:event][:ticket_add_1],
      :ticket_add_2 => params[:event][:ticket_add_2],
      :featured => params[:event][:featured],
      :user_id => params[:event][:user_id],
      :date => t,
      :approved => params[:event][:approved],
      :avatar => params[:event][:avatar],
      :flyer => params[:event][:flyer],
      :description => params[:event][:description],
      :latitude => params[:event][:latitude],
      :longitude => params[:event][:longitude],
      :venue => params[:event][:venue],
      :url => params[:event][:url],
      :start => Chronic.parse(params[:event][:start]),
      :end => Chronic.parse(params[:event][:end]),
      :venue => params[:event][:venue],
      :url => params[:event][:url]
      )


    if @event.save
---
INSERT INTO "events" ("approved", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "borough", "created_at", "date", "description", "end", "event_name", "featured", "flyer_content_type", "flyer_file_name", "flyer_file_size", "flyer_updated_at", "latitude", "location", "longitude", "start", "ticket_price", "updated_at", "url", "user_id", "venue") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"